# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [3]:
cur.execute('''SELECT firstName, lastName, city, state, employees.officeCode, offices.officeCode
                FROM employees, offices
                WHERE employees.officeCode = offices.officeCode
                ORDER BY firstName, lastName
                ''').fetchall()

[('Andy', 'Fixter', 'Sydney', '', '6', '6'),
 ('Anthony', 'Bow', 'San Francisco', 'CA', '1', '1'),
 ('Barry', 'Jones', 'London', '', '7', '7'),
 ('Diane', 'Murphy', 'San Francisco', 'CA', '1', '1'),
 ('Foon Yue', 'Tseng', 'NYC', 'NY', '3', '3'),
 ('George', 'Vanauf', 'NYC', 'NY', '3', '3'),
 ('Gerard', 'Bondur', 'Paris', '', '4', '4'),
 ('Gerard', 'Hernandez', 'Paris', '', '4', '4'),
 ('Jeff', 'Firrelli', 'San Francisco', 'CA', '1', '1'),
 ('Julie', 'Firrelli', 'Boston', 'MA', '2', '2'),
 ('Larry', 'Bott', 'London', '', '7', '7'),
 ('Leslie', 'Jennings', 'San Francisco', 'CA', '1', '1'),
 ('Leslie', 'Thompson', 'San Francisco', 'CA', '1', '1'),
 ('Loui', 'Bondur', 'Paris', '', '4', '4'),
 ('Mami', 'Nishi', 'Tokyo', 'Chiyoda-Ku', '5', '5'),
 ('Martin', 'Gerard', 'Paris', '', '4', '4'),
 ('Mary', 'Patterson', 'San Francisco', 'CA', '1', '1'),
 ('Pamela', 'Castillo', 'Paris', '', '4', '4'),
 ('Peter', 'Marsh', 'Sydney', '', '6', '6'),
 ('Steve', 'Patterson', 'Boston', 'MA', '2', '2'),
 ('Tom', 'King', 'Sydney', '', '6', '6'),
 ('William', 'Patterson', 'Sydney', '', '6', '6'),
 ('Yoshimi', 'Kato', 'Tokyo', 'Chiyoda-Ku', '5', '5')]

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [4]:
cur.execute('''SELECT * FROM customers
                JOIN orders
                USING (customerNumber)
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,orderNumber,orderDate,requiredDate,shippedDate,status,comments
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00,10123,2003-05-20,2003-05-29,2003-05-22,Shipped,
1,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00,10298,2004-09-27,2004-10-05,2004-10-01,Shipped,
2,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00,10345,2004-11-25,2004-12-01,2004-11-26,Shipped,
3,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00,10124,2003-05-21,2003-05-29,2003-05-25,Shipped,Customer very concerned about the exact color ...
4,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00,10278,2004-08-06,2004-08-16,2004-08-09,Shipped,

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [5]:
cur.execute('''SELECT * FROM orders
                JOIN orderdetails
                USING (orderNumber)
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productCode,quantityOrdered,priceEach,orderLineNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_1749,30,136.00,3
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_4409,22,75.46,4
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S24_3969,49,35.29,1
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,S18_2325,25,108.06,4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [7]:
cur.execute('''SELECT * FROM orders

            JOIN products USING (productCode)
            ;''')""
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

OperationalError: cannot join using column productCode - column not present in both tables

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!